app/controllers/questions_controller.rb

  def index
    # CODE REVIEW: This is REALLY confusing. My initial reaction was that this
    # should be (at a minumum):
    # Question.all.sort_by! { |question| question.visits.count }
    # But it turns out that Visit is a has_one association from Question. What
    # is actually happening here? If this is actually a has_many (like it looks)
    # then this sorting should be able to be done in the DB
    @questions = Question.all.sort_by! { |question| Visit.where(visitable_id: question.id).count }
---
SELECT COUNT(*) FROM "visits" WHERE "visits"."visitable_id" = 1